In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
sun=pd.read_csv(r'C:\Users\Vikas\Downloads\ISSN_D_tot.csv\silso.csv')
sun.head()

   1818  01  01.1  1818.004   -1  1
0  1818   1     2  1818.007   -1  1
1  1818   1     3  1818.010   -1  1
2  1818   1     4  1818.012   -1  1
3  1818   1     5  1818.015   -1  1
4  1818   1     6  1818.018   -1  1

in this csv file there are so many problems:-
* CSV file has no column header
* columns 0-2:gregorian date(year,month,date)
* columns 3: date as fraction as year
* columns 4:daily total sunspot number
* columns 5:definitive/provisional indictor(0 or 1)
<li> Missing value in columns 4: indicted by -1
    <li> Dates representation inconvenient

In [3]:
sun.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71860 entries, 0 to 71859
Data columns (total 6 columns):
1818        71860 non-null int64
01          71860 non-null int64
01.1        71860 non-null int64
1818.004    71860 non-null float64
 -1         71860 non-null int64
1           71860 non-null int64
dtypes: float64(1), int64(5)
memory usage: 3.3 MB

In [4]:
sun=pd.read_csv(r'C:\Users\Vikas\Downloads\ISSN_D_tot.csv\silso.csv',header=None)
sun.head()

      0  1  2         3  4  5
0  1818  1  1  1818.004 -1  1
1  1818  1  2  1818.007 -1  1
2  1818  1  3  1818.010 -1  1
3  1818  1  4  1818.012 -1  1
4  1818  1  5  1818.015 -1  1

In [5]:
#define the column names
col_name=['year','month','day','dec_date','sunspots','definite']

In [6]:
#put column name
sun=pd.read_csv(r'C:\Users\Vikas\Downloads\ISSN_D_tot.csv\silso.csv',header=None,names=col_name)
sun.head()

   year  month  day  dec_date  sunspots  definite
0  1818      1    1  1818.004        -1         1
1  1818      1    2  1818.007        -1         1
2  1818      1    3  1818.010        -1         1
3  1818      1    4  1818.012        -1         1
4  1818      1    5  1818.015        -1         1

In [7]:
#here,we put the -1 with NaN value
sun=pd.read_csv(r'C:\Users\Vikas\Downloads\ISSN_D_tot.csv\silso.csv',header=None,names=col_name,na_values=' -1')
sun.head()

   year  month  day  dec_date  sunspots  definite
0  1818      1    1  1818.004       NaN         1
1  1818      1    2  1818.007       NaN         1
2  1818      1    3  1818.010       NaN         1
3  1818      1    4  1818.012       NaN         1
4  1818      1    5  1818.015       NaN         1

In [8]:
#here,we fill the particular column only with NaN value
sun=pd.read_csv(r'C:\Users\Vikas\Downloads\ISSN_D_tot.csv\silso.csv',header=None,names=col_name,na_values={'sunspots':[' -1']})
sun.head()

   year  month  day  dec_date  sunspots  definite
0  1818      1    1  1818.004       NaN         1
1  1818      1    2  1818.007       NaN         1
2  1818      1    3  1818.010       NaN         1
3  1818      1    4  1818.012       NaN         1
4  1818      1    5  1818.015       NaN         1

In [9]:
#change the date format with the help of parse_dates
sun=pd.read_csv(r'C:\Users\Vikas\Downloads\ISSN_D_tot.csv\silso.csv',header=None,names=col_name,na_values={'sunspots':[' -1']},parse_dates=[[0,1,2]])
sun.head()

  year_month_day  dec_date  sunspots  definite
0     1818-01-01  1818.004       NaN         1
1     1818-01-02  1818.007       NaN         1
2     1818-01-03  1818.010       NaN         1
3     1818-01-04  1818.012       NaN         1
4     1818-01-05  1818.015       NaN         1

In [10]:
sun.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71861 entries, 0 to 71860
Data columns (total 4 columns):
year_month_day    71861 non-null datetime64[ns]
dec_date          71861 non-null float64
sunspots          68614 non-null float64
definite          71861 non-null int64
dtypes: datetime64[ns](1), float64(2), int64(1)
memory usage: 2.2 MB

In [11]:
#set the index
sun.index=sun['year_month_day']

In [12]:
#change the index name
sun.index.name='date'

In [13]:
sun.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 71861 entries, 1818-01-01 to 2014-09-30
Data columns (total 4 columns):
year_month_day    71861 non-null datetime64[ns]
dec_date          71861 non-null float64
sunspots          68614 non-null float64
definite          71861 non-null int64
dtypes: datetime64[ns](1), float64(2), int64(1)
memory usage: 2.7 MB

In [14]:
#define the columns
cols=['sunspots','definite']

In [15]:
sun=sun[cols]

In [16]:
#show the middle value
sun.iloc[10:20,:]

            sunspots  definite
date
1818-01-11       NaN         1
1818-01-12       NaN         1
1818-01-13      22.0         1
1818-01-14       NaN         1
1818-01-15       NaN         1
1818-01-16       NaN         1
1818-01-17      46.0         1
1818-01-18      59.0         1
1818-01-19      63.0         1
1818-01-20       NaN         1

In [17]:
#save file
out_csv='sun.csv'

In [18]:
sun.to_csv(out_csv)